The  PointLightShape  type exposes the following members.
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from  LightShape  .)
 See Also
  PointLightShape Class
  Autodesk.Revit.DB.Lighting Namespace